app/Controllers/Admin/ArticleController.php

    public function index()
    {
        $keyword = $this->request->getGet('q');
        $builder = $this->articleModel->withCategory();
        if ($keyword) {
            $builder->like('articles.title', $keyword);
        }

        $data = [
            'title'    => 'Manajemen Artikel',
            'articles' => $builder->paginate(10),
            'pager'    => $this->articleModel->pager,
            'keyword'  => $keyword,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`