app/Controllers/Admin/ArtikelController.php

SELECT COUNT(*) AS `numrows`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`
---
    public function index()
    {
        $keyword = $this->request->getGet('q');
        $builder = $this->articleModel->withCategory();
        if ($keyword) {
            $builder->like('articles.title', $keyword);
        }

        $data = [
            'title'    => 'Manajemen Artikel',
            'articles' => $builder->paginate(10),

SELECT *
FROM `categories`
ORDER BY `name` ASC
---
    public function create()
    {
        $data = [
            'title'      => 'Tambah Artikel',
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),