app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `articles`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `status` = 'draft'
---
    public function index()
    {
        $articleModel  = new ArticleModel();
        $categoryModel = new CategoryModel();

        $data = [
            'title'           => 'Dashboard',
            'total_articles'  => $articleModel->countAll(),
            'total_categories' => $categoryModel->countAll(),
            'total_published' => $articleModel->where('status', 'published')->countAllResults(),
            'total_draft'     => $articleModel->where('status', 'draft')->countAllResults(),