app/Controllers/Admin/KategoriController.php

SELECT `categories`.*, COUNT(articles.id) as articles_count
FROM `categories`
LEFT JOIN `articles` ON `articles`.`category_id` = `categories`.`id`
GROUP BY `categories`.`id`
ORDER BY `categories`.`name` ASC
---
    public function index()
    {
        $data = [
            'title'      => 'Manajemen Kategori',
            'categories' => $this->categoryModel->withArticleCount()->orderBy('categories.name', 'ASC')->findAll(),