app/Controllers/Frontend/HomeController.php

SELECT *
FROM `categories`
ORDER BY `name` ASC
---
    public function index()
    {
        $latest  = $this->articleModel->published()->limit(7)->find();

        $data = [
            'title'      => 'Beranda',
            'headline'   => $latest[0] ?? null,
            'articles'   => array_slice($latest, 1),
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),

SELECT *
FROM `categories`
ORDER BY `name` ASC
---
    public function articles()
    {
        $keyword    = $this->request->getGet('q');
        $categoryId = $this->request->getGet('kategori');

        $builder = $this->articleModel->published();

        if ($keyword) {
            $builder->like('articles.title', $keyword);
        }

        if ($categoryId) {
            $builder->where('articles.category_id', $categoryId);
        }

        $data = [
            'title'      => 'Semua Artikel',
            'articles'   => $builder->paginate(5),
            'pager'      => $this->articleModel->pager,
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),

SELECT *
FROM `categories`
ORDER BY `name` ASC
---
    public function about()
    {
        return view('frontend/about', [
            'title'      => 'Tentang',
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),